/***   作業 1 填答區開始   **/

// 範例填答：解答是 
//true
//false
//false



/***   作業 1 填答區結束   **/





/***   作業 2 填答區開始   **/

// 範例回覆：解答是 
//true
//false
//false



/***   作業 2 填答區結束   **/




/***   作業 3 填答區開始   **/

// 範例回覆：解答是 
// m 為：
// m 為：
// 原因是



/***   作業 3 填答區結束   **/




/***   作業 4 填答區開始   **/
// 請將作業四截圖程式碼都寫在這，並刻意練習



/***   作業 4 填答區結束   **/





/***   作業 5 填答區開始   **/
// 請將作業五截圖程式碼都寫過來，並附上您的答案



/***   作業 5 填答區結束   **/



/***   作業 6 填答區開始   **/
// 範例回覆：解答是
// false
// false
// false

//是否有折扣資格
// true 或 false
// 原因是



/***   作業 6 填答區結束   **/



/***   作業 7 填答區開始   **/
// 請將作業七截圖程式碼都寫過來，並附上您的答案



/***   作業 7 填答區結束   **/






/***   作業 8 填答區開始   **/
// 請將作業八截圖程式碼都寫過來，並附上您的答案



/***   作業 8 填答區結束   **/


/***   作業 9 填答區開始   **/
// 請將作業九截圖程式碼都寫過來，並附上您的答案



/***   作業 9 填答區結束   **/



/***   作業 10 填答區開始   **/
// 需附上 Whimsical 連結（記得開啟權限）

/***   作業 10 填答區開始   **/